tutorials/heatTransfer/buoyantSimpleSolver/circuitBoardCooling/0.org/U
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0.1 0 0 );

boundaryField
{
    floor
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    ceiling
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    inlet
    {
        type            fixedValue;
        value           uniform ( 0.1 0 0 );
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform ( 0 0 0 );
        value           uniform ( 0.1 0 0 );
    }
    fixedWalls
    {
        type            empty;
    }
    "baffle1Wall.*"
    {
        type            calculated;
    }
}


// ************************************************************************* //
