tutorials/heatTransfer/buoyantSimpleSolver/circuitBoardCooling/0.org/epsilon
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.01;

boundaryField
{
    floor
    {
        type            compressible::epsilonWallFunction;
        value           uniform 0.01;
    }
    ceiling
    {
        type            compressible::epsilonWallFunction;
        value           uniform 0.01;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.01;
    }
    outlet
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            empty;
    }
    "baffle1Wall.*"
    {
         type           calculated;
    }
}


// ************************************************************************* //
