tutorials/heatTransfer/buoyantSimpleSolver/circuitBoardCooling/0.org/mut
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      mut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            mutkWallFunction;
        value           uniform 0;
    }
    ceiling
    {
        type            mutkWallFunction;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    fixedWalls
    {
        type            empty;
    }
    "baffle1Wall.*"
    {
        type           calculated;
    }
}


// ************************************************************************* //
