tutorials/heatTransfer/buoyantSimpleSolver/circuitBoardCooling/constant/thermoBaffleProperties
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermoBaffleProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoBaffleModel  none;

active          no;

regionName      none;

thermoBaffle2DCoeffs
{
}

noThermoCoeffs
{
}
// ************************************************************************* //
