tutorials/heatTransfer/buoyantSimpleSolver/circuitBoardCooling/system/baffleRegion/changeDictionaryDict
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    T
    {
        boundaryField
        {
            "region0_to.*"
            {
                type                compressible::temperatureThermoBaffle;
                neighbourFieldName  T;
                K                   solidThermo;
                KName               none;

                value               uniform 300;
            }
            baffleFaces2_side
            {
                type            zeroGradient;
            }
            floor
            {
                type            fixedValue;
                value           uniform 300;
            }
            fixedWalls
            {
                type            empty;
            }
        }
    }

    boundary
    {
        floor
        {
            type        patch;
        }
    }
}

// ************************************************************************* //
