tutorials/heatTransfer/buoyantSimpleSolver/circuitBoardCooling/system/baffleRegion/fvSchemes
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/baffleRegion";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

divSchemes
{
     default        none;
}

gradSchemes
{
    default         Gauss linear;
}

laplacianSchemes
{
    default         none;
    laplacian(K,T)  Gauss linear uncorrected;
}


// ************************************************************************* //
