tutorials/heatTransfer/buoyantSimpleSolver/circuitBoardCooling/system/baffleRegion/fvSolution
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/baffleRegion";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver           PCG;
        smoother         GaussSeidel;
        preconditioner   SSGS;
        tolerance        1e-06;
        relTol           0;
    }
}

nNonOrthCorr        0;

relaxationFactors
{
    T       1;
}

// ************************************************************************* //
