tutorials/heatTransfer/buoyantSimpleSolver/circuitBoardCooling/system/fvSchemes
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss limitedLinear 0.2;
    div(phi,K)      Gauss limitedLinear 0.2;
    div(phi,h)      Gauss limitedLinear 0.2;
    div(phi,k)      Gauss limitedLinear 0.2;
    div(phi,epsilon) Gauss limitedLinear 0.2;
    div(phi,omega) Gauss limitedLinear 0.2;
    div((muEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         none;
    laplacian(rhorAUf,p_rgh) Gauss linear uncorrected;
    laplacian(muEff,U) Gauss linear uncorrected;
    laplacian((rho*(1|A(U))),p_rgh) Gauss linear uncorrected;
    laplacian(alphaEff,h) Gauss linear uncorrected;
    laplacian(DkEff,k) Gauss linear uncorrected;
    laplacian(DepsilonEff,epsilon) Gauss linear uncorrected;
    laplacian(DomegaEff,omega) Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}


// ************************************************************************* //
